/**
 * @author zhucheng
 * @create 2021-04-27-13:10
 */
package easy.stack;

import java.util.ArrayList;
import java.util.List;

//给你一个目标数组 target 和一个整数 n。每次迭代，需要从 list = {1,2,3..., n} 中依序读取一个数字。
//
// 请使用下述操作来构建目标数组 target ：
//
//
// Push：从 list 中读取一个新元素， 并将其推入数组中。
// Pop：删除数组中的最后一个元素。
// 如果目标数组构建完成，就停止读取更多元素。
//
//
// 题目数据保证目标数组严格递增，并且只包含 1 到 n 之间的数字。
//
// 请返回构建目标数组所用的操作序列。
//
// 题目数据保证答案是唯一的。
//
//
//
// 示例 1：
//
//
//输入：target = [1,3], n = 3
//输出：["Push","Push","Pop","Push"]
//解释：
//读取 1 并自动推入数组 -> [1]
//读取 2 并自动推入数组，然后删除它 -> [1]
//读取 3 并自动推入数组 -> [1,3]
//
//
// 示例 2：
//
//
//输入：target = [1,2,3], n = 3
//输出：["Push","Push","Push"]
//
//
// 示例 3：
//
//
//输入：target = [1,2], n = 4
//输出：["Push","Push"]
//解释：只需要读取前 2 个数字就可以停止。
//
//
// 示例 4：
//
//
//输入：target = [2,3,4], n = 4
//输出：["Push","Pop","Push","Push","Push"]
//
//
//
//
// 提示：
//
//
// 1 <= target.length <= 100
// 1 <= target[i] <= 100
// 1 <= n <= 100
// target 是严格递增的
//
// Related Topics 栈
// 👍 21 👎 0
public class 用栈操作构建数组1441 {
    /*
    思路:由于是严格单点递增的，所以遍历target数组，缺失的数据表示经历了push，pop操作
    前一个出现的元素和当前出现的元素之间相差几个，说明经历了几次push，pop。没有缺失的元素
    只有push操作。
     */
    public List<String> buildArray(int[] target, int n) {
        List<String> list = new ArrayList<>();
        //定义count变量用来保持递增。
        int count = 1;
        for (int i = 0; i < target.length; i++) {
            while(count < target[i]){
                list.add("Push");
                list.add("Pop");
                count++;
            }
            list.add("Push");
            count++;
        }

        return list;
    }
}
