/**
 * @author zhucheng
 * @create 2021-04-14-13:36
 */
package easy.array;
//给定一个未经排序的整数数组，找到最长且 连续递增的子序列，并返回该序列的长度。
//
// 连续递增的子序列 可以由两个下标 l 和 r（l < r）确定，如果对于每个 l <= i < r，都有 nums[i] < nums[i + 1] ，那
//么子序列 [nums[l], nums[l + 1], ..., nums[r - 1], nums[r]] 就是连续递增子序列。
//
//
//
// 示例 1：
//
//
//输入：nums = [1,3,5,4,7]
//输出：3
//解释：最长连续递增序列是 [1,3,5], 长度为3。
//尽管 [1,3,5,7] 也是升序的子序列, 但它不是连续的，因为 5 和 7 在原数组里被 4 隔开。
//
//
// 示例 2：
//
//
//输入：nums = [2,2,2,2,2]
//输出：1
//解释：最长连续递增序列是 [2], 长度为1。
//
//
//
//
// 提示：
//
//
// 0 <= nums.length <= 104
// -109 <= nums[i] <= 109
//
// Related Topics 数组
// 👍 175 👎 0
public class 最长连续递增序列674 {
    public int findLengthOfLCIS(int[] nums) {
        //边界条件
        if(nums.length==0) return 0;

        //遍历数组，len记录连续递增子序列的长度。只需要遍历一遍
        int len = 0;
        for (int i = 0; i < nums.length; ) {
            int j = i+1;
            while(j<nums.length && nums[j] > nums[j-1]){
                j++;
            }
            len = Math.max(len,j-i);
            i = j;
        }
        return len;
    }
}
